Revit 2024 API
FabricationPartSizeMap.ServiceId Property
 The service identifier of the straight.
Namespace: Autodesk.Revit.DB.Fabrication
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.2
Syntax
C#
public int ServiceId { get; set; }
Visual Basic
Public Property ServiceId As Integer
	Get
	Set
Visual C++
public:
property int ServiceId {
	int get ();
	void set (int value);
}
See Also
FabricationPartSizeMap Class
Autodesk.Revit.DB.Fabrication Namespace